---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewShowHiddenLines
source: html/e9118882-7ee0-719f-b8bf-9e9895bbefcb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewShowHiddenLines Property

"Show Hidden Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewShowHiddenLines { get; }
```